Revit 2027 API
BuiltInFailures.StairRampFailures.TreadFrontProfileInvalid Property
 This profile cannot be used for the front of treads. Please choose a profile composed of a closed loop of lines with exactly one lines coincident with the y-axis. This lines will define the connection of this profile to the tread.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TreadFrontProfileInvalid { get; }
Public Shared ReadOnly Property TreadFrontProfileInvalid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TreadFrontProfileInvalid {
	FailureDefinitionId^ get ();
}
static member TreadFrontProfileInvalid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace